{
  "source": "speculum-principum",
  "sourceType": "github-discussions",
  "category": "People",
  "title": "Francesco Sforza",
  "slug": "francesco-sforza",
  "discussionNumber": 173,
  "discussionUrl": "https://github.com/terrence-giggy/speculum-principum/discussions/173",
  "retrievedAt": "2025-12-04T04:45:57.545Z",
  "updatedAt": "2025-11-27T22:46:32Z",
  "checksum": "063a275307f33c7de9fd6015b0116032a87cc567bbf9a92250696604426f94ad",
  "body": "# Francesco Sforza\n\n**Type:** Person\n**Confidence:** 88%\n\n## Summary\n\nA historical figure referenced as an example of a newly founded monarchy. A historical figure who rose from a private citizen to become the Duke of Milan through his own abilities. A military leader who became Duke of Milan, known for his role in the political dynamics of Italy during the Renaissance. Francesco Sforza is noted for becoming Duke of Milan through military prowess and organization, emphasizing the importance of being well-armed. A historical figure noted for his role in the establishment of the Sforza dynasty in Milan, mentioned in the context of fortresses and their implications for rulers.\n\n## Attributes\n\n| Attribute | Value |\n|-----------|-------|\n| context | Example of a new dominion acquired through ability. |\n| dynasty | Sforza |\n| historical_context | Involved in the power struggles of Italy |\n| method_of_acquisition | by ability |\n| notable_action | Rose from private status to duke through military strength |\n| notable_actions | Hired by the Milanese against the Venetians |\n| role | Duke of Milan |\n| status | maintained position with little trouble |\n\n## Source Mentions\n\n> as was Milan to Francesco Sforza\n> Francesco, by appropriate means and through great abilities, from citizen became Duke of Milan, and what he had attained after a thousand difficulties he maintained with little trouble.\n> Francesco directed his ambition towards Lombardy...\n> The Milanese, on the death of Duke Philip, hired Francesco Sforza against the Venetians...\n> Francesco Sforza, through being well armed, became, from private status, Duke of Milan.\n\n_...and 1 more mentions._\n\n## Source Documents\n\n- `1327a866df4a...`\n\n---\n_Generated from knowledge graph on 2025-11-27 22:46 UTC_"
}