{
  "source": "speculum-principum",
  "sourceType": "github-discussions",
  "category": "People",
  "title": "Niccolo Machiavelli",
  "slug": "niccolo-machiavelli",
  "discussionNumber": 183,
  "discussionUrl": "https://github.com/terrence-giggy/speculum-principum/discussions/183",
  "retrievedAt": "2025-12-04T04:45:57.544Z",
  "updatedAt": "2025-11-27T22:46:43Z",
  "checksum": "d4a86cb00a1886c80fb08566759cf06444dcfc9d7b64de4a9e45b8e48fb40fae",
  "body": "# Niccolo Machiavelli\n\n**Type:** Person\n**Confidence:** 100%\n\n## Summary\n\nThe author of 'The Prince', a political treatise on statecraft. An influential political philosopher known for his work 'The Prince', which discusses the acquisition and maintenance of political power. An influential political philosopher known for his work 'The Prince', which discusses the acquisition and maintenance of political power. An Italian diplomat, philosopher, and writer, known for his political treatise 'The Prince', which discusses the nature of power and statecraft. Niccolo Machiavelli is the author of the text, providing insights on military organization and the nature of power. An influential political philosopher known for his work 'The Prince', which discusses the qualities and strategies of effective rulers. An influential political philosopher known for his work 'The Prince', which discusses the nature of power and the qualities of effective rulers. An influential political philosopher known for his work 'The Prince', which discusses the qualities and strategies of effective rulers. An Italian diplomat and philosopher known for his political treatise 'The Prince', which discusses the nature of power and leadership. An influential political philosopher known for his work 'The Prince', which discusses political power and statecraft.\n\n## Attributes\n\n| Attribute | Value |\n|-----------|-------|\n| birth_date | May 3, 1469 |\n| context | His work discusses various forms of government and the nature of power. |\n| death_date | June 22, 1527 |\n| nationality | Italian |\n| notable_work | The Prince |\n| role | Political Philosopher |\n| time_period | Renaissance |\n| work | The Prince |\n\n## Source Mentions\n\n> THE PRINCE BY NICCOLO MACHIAVELLI\n> the ruler of a foreign province as described, should make himself the leader and defender of his less powerful neighbours\n> the Romans in the provinces they took, always followed this policy\n> the desire to acquire possessions is a very natural and ordinary thing\n> not had those two armies upon him, or else had been in good health, he would have survived every difficulty.\n\n_...and 13 more mentions._\n\n## Source Documents\n\n- `1327a866df4a...`\n\n---\n_Generated from knowledge graph on 2025-11-27 22:46 UTC_"
}